GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_hard_i2c.c
/*
 * Copyright (c) 2006-2025, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author            Notes
 * 2021-12-20     BruceOu           the first version
 */

#include "drv_hard_i2c.h"

#ifdef RT_USING_I2C

#define LOG_TAG              "drv.i2c"
#include <rtdbg.h>

#if !defined(BSP_USING_HARD_I2C0) && !defined(BSP_USING_HARD_I2C1) && !defined(BSP_USING_HARD_I2C2) && !defined(BSP_USING_HARD_I2C3)  && !defined(BSP_USING_HARD_I2C4)  && !defined(BSP_USING_HARD_I2C5)
#error "Please define at least one BSP_USING_I2Cx"
/* this driver can be disabled at menuconfig → RT-Thread Components → Device Drivers */
#endif

#if defined(BSP_USING_HARD_I2C0)
struct rt_i2c_bus_device i2c0;
#endif /* BSP_USING_I2C0 */

#if defined(BSP_USING_HARD_I2C1)
struct rt_i2c_bus_device i2c1;
#endif /* BSP_USING_I2C1 */

#if defined(BSP_USING_HARD_I2C2)
struct rt_i2c_bus_device i2c2;
#endif /* BSP_USING_I2C2 */

#if defined(BSP_USING_HARD_I2C3)
struct rt_i2c_bus_device i2c3;
#endif /* BSP_USING_I2C3 */

#if defined(BSP_USING_HARD_I2C4)
struct rt_i2c_bus_device i2c4;
#endif /* BSP_USING_I2C4 */

#if defined(BSP_USING_HARD_I2C5)
struct rt_i2c_bus_device i2c5;
#endif /* BSP_USING_I2C5 */

#if defined (SOC_SERIES_GD32F5xx)
#define i2c_flag_get_gd                      i2c_add_flag_get
#define i2c_timing_config_gd                 i2c_add_timing_config
#define i2c_master_clock_config_gd           i2c_add_master_clock_config
#define i2c_enable_gd                        i2c_add_enable 
#define i2c_flag_clear_gd                    i2c_add_flag_clear
#define i2c_stop_on_bus_gd                   i2c_add_stop_on_bus
#define i2c_transfer_byte_number_config_gd   i2c_add_transfer_byte_number_config
#define i2c_start_on_bus_gd                  i2c_add_start_on_bus
#define i2c_address10_enable_gd              i2c_add_address10_enable
#define i2c_address10_disable_gd             i2c_add_address10_disable
#define i2c_master_addressing_gd             i2c_add_master_addressing
#define i2c_data_transmit_gd                 i2c_add_data_transmit
#define i2c_data_receive_gd                  i2c_add_data_receive

#define I2C_FLAG_RBNE_GD                     I2C_ADD_FLAG_RBNE
#define I2C_STAT_GD                          I2C_ADD_STAT
#define I2C_STAT_TBE_GD                      I2C_ADD_STAT_TBE
#define I2C_STAT_TI_GD                       I2C_ADD_STAT_TI
#define I2C_MASTER_RECEIVE_GD                I2C_ADD_MASTER_RECEIVE
#define I2C_MASTER_TRANSMIT_GD               I2C_ADD_MASTER_TRANSMIT
#define I2C_FLAG_I2CBSY_GD                   I2C_ADD_FLAG_I2CBSY
#define I2C_FLAG_TC_GD                       I2C_ADD_FLAG_TC
#define I2C_FLAG_TI_GD                       I2C_ADD_FLAG_TI
#define I2C_FLAG_STPDET_GD                   I2C_ADD_FLAG_STPDET

#else

#define i2c_flag_get_gd                      i2c_flag_get
#define i2c_timing_config_gd                 i2c_timing_config
#define i2c_master_clock_config_gd           i2c_master_clock_config
#define i2c_enable_gd                        i2c_enable
#define i2c_flag_clear_gd                    i2c_flag_clear
#define i2c_data_receive_gd                  i2c_data_receive
#define i2c_data_transmit_gd                 i2c_data_transmit
#define i2c_address10_enable_gd              i2c_address10_enable
#define i2c_address10_disable_gd             i2c_address10_disable
#define i2c_master_addressing_gd             i2c_master_addressing
#define i2c_transfer_byte_number_config_gd   i2c_transfer_byte_number_config
#define i2c_start_on_bus_gd                  i2c_start_on_bus
#define i2c_stop_on_bus_gd                   i2c_stop_on_bus

#if defined SOC_SERIES_GD32E51x

#undef  i2c_flag_get_gd
#undef  i2c_flag_clear_gd
#undef  i2c_master_addressing_gd
#define i2c_flag_get_gd                      i2c2_flag_get
#define i2c_flag_clear_gd                    i2c2_flag_clear
#define i2c_master_addressing_gd             i2c2_master_addressing

#undef  I2C_STAT_GD
#undef  I2C_STAT_TBE_GD
#undef  I2C_STAT_TI_GD
#define I2C_STAT_GD                          I2C2_STAT
#define I2C_STAT_TBE_GD                      I2C2_STAT_TBE
#define I2C_STAT_TI_GD                       I2C2_STAT_TI

#undef  I2C_MASTER_RECEIVE_GD
#undef  I2C_MASTER_TRANSMIT_GD
#define I2C_MASTER_RECEIVE_GD                I2C2_MASTER_RECEIVE
#define I2C_MASTER_TRANSMIT_GD               I2C2_MASTER_TRANSMIT

#undef  I2C_FLAG_RBNE_GD
#undef  I2C_FLAG_I2CBSY_GD
#undef  I2C_FLAG_TC_GD
#undef  I2C_FLAG_TI_GD
#undef  I2C_FLAG_STPDET_GD
#define I2C_FLAG_RBNE_GD                     I2C2_FLAG_RBNE
#define I2C_FLAG_I2CBSY_GD                   I2C2_FLAG_I2CBSY
#define I2C_FLAG_TC_GD                       I2C2_FLAG_TC
#define I2C_FLAG_TI_GD                       I2C2_FLAG_TI
#define I2C_FLAG_STPDET_GD                   I2C2_FLAG_STPDET
/* also needed in write path */
#define I2C_FLAG_TBE_GD                      I2C2_FLAG_TBE

#else
#define I2C_FLAG_RBNE_GD                     I2C_FLAG_RBNE
#define I2C_STAT_GD                          I2C_STAT
#define I2C_STAT_TBE_GD                      I2C_STAT_TBE
#define I2C_STAT_TI_GD                       I2C_STAT_TI
#define I2C_MASTER_RECEIVE_GD                I2C_MASTER_RECEIVE
#define I2C_MASTER_TRANSMIT_GD               I2C_MASTER_TRANSMIT
#define I2C_FLAG_I2CBSY_GD                   I2C_FLAG_I2CBSY
#define I2C_FLAG_TC_GD                       I2C_FLAG_TC
#define I2C_FLAG_TI_GD                       I2C_FLAG_TI
#define I2C_FLAG_STPDET_GD                   I2C_FLAG_STPDET
/* used in write path */
#define I2C_FLAG_TBE_GD                      I2C_FLAG_TBE

#endif

#endif

#if defined (SOC_SERIES_GD32F5xx)
#define IS_I2C_LEGACY(periph)  ((periph) == I2C0 || (periph) == I2C1 || (periph) == I2C2)
#elif defined (SOC_SERIES_GD32F4xx) || defined (SOC_SERIES_GD32F3x0)
#define IS_I2C_LEGACY(periph)  (1)
#elif defined (SOC_SERIES_GD32H7xx) || defined (SOC_SERIES_GD32L23x) 
#define IS_I2C_LEGACY(periph)  (0)
#elif  defined (SOC_SERIES_GD32F30x) 
#define IS_I2C_LEGACY(periph)  (1)
#elif defined SOC_SERIES_GD32E51x 
#define IS_I2C_LEGACY(periph)  ((periph) == I2C0 || (periph) == I2C1)
#endif

#if !defined(SOC_SERIES_GD32H75E) && !defined(SOC_SERIES_GD32E51x) && !defined(SOC_SERIES_GD32F3x0)
static const struct gd32_i2c_bus gd_i2c_config[] = {
#ifdef BSP_USING_HARD_I2C0
    {
    I2C0,    /* uart peripheral index */

    RCU_I2C0, RCU_GPIOB, RCU_GPIOB,    /* periph clock, scl gpio clock, sda gpio clock */
#if defined (SOC_SERIES_GD32F30x)
        GPIOB, GPIO_MODE_AF_OD, GPIO_PIN_6,            /* scl port, scl alternate, scl pin */
        GPIOB, GPIO_MODE_AF_OD, GPIO_PIN_7,           /* sda port, sda alternate, sda pin */
#else
        GPIOB, GPIO_AF_4, GPIO_PIN_6,             /* scl port, scl alternate, scl pin */
        GPIOB, GPIO_AF_4, GPIO_PIN_7,            /* sda port, sda alternate, sda pin */
#endif
        &i2c0,
        "hwi2c0",
    },
#endif

#ifdef BSP_USING_HARD_I2C1
    {
    I2C1,    /* uart peripheral index */
#if defined (SOC_SERIES_GD32F30x)
        RCU_I2C1, RCU_GPIOB, RCU_GPIOB,       /* periph clock, scl gpio clock, sda gpio clock */

        GPIOB, GPIO_MODE_AF_OD, GPIO_PIN_10,           /* scl port, scl alternate, scl pin */
        GPIOB, GPIO_MODE_AF_OD, GPIO_PIN_11,          /* sda port, sda alternate, sda pin */
#else
        RCU_I2C1, RCU_GPIOH, RCU_GPIOB,       /* periph clock, scl gpio clock, sda gpio clock */

        GPIOH, GPIO_AF_4, GPIO_PIN_4,          /* scl port, scl alternate, scl pin */
        GPIOB, GPIO_AF_4, GPIO_PIN_11,          /* sda port, sda alternate, sda pin */
#endif

        &i2c1,
        "hwi2c1",
    },
#endif

#ifdef BSP_USING_HARD_I2C2
    {
    I2C2,    /* uart peripheral index */

    RCU_I2C2, RCU_GPIOA, RCU_GPIOC,    /* periph clock, scl gpio clock, sda gpio clock */

    GPIOA, GPIO_AF_4, GPIO_PIN_8,    /* scl port, scl alternate, scl pin */
    GPIOC, GPIO_AF_4, GPIO_PIN_9,    /* sda port, sda alternate, sda pin */

        &i2c2,
        "hwi2c2",
    },
#endif

#ifdef BSP_USING_HARD_I2C3
    {
    I2C3,    /* uart peripheral index */

    RCU_I2C3, RCU_GPIOF, RCU_GPIOF,    /* periph clock, scl gpio clock, sda gpio clock */

